<?php

return [
    'title' => 'Μετατροπή Timestamp σε Ημερομηνία - Μετατροπή Unix Timestamp',
    'h1' => 'Μετατροπέας Unix Timestamp σε Ημερομηνία',
    'meta_keywords' => 'μετατροπέας timestamp σε ημερομηνία',
    'meta_description' => 'Μετατρέψτε εύκολα τα Unix timestamps σε αναγνώσιμες ημερομηνίες με τον δωρεάν διαδικτυακό μετατροπέα μας για timestamps. Γρήγορος, ακριβής και εύκολος στη χρήση.',
    'meta_title' => 'Μετατροπέας Timestamp σε Ημερομηνία - Άμεση Μετατροπή Unix Timestamp',
    'locale' => 'el-GR',
    'select_language' => 'Επιλέξτε Γλώσσα',
    'summary' => 'Μετατρέψτε εύκολα τα Unix timestamps',
    'copy_time' => 'Αντιγραφή',
    'done_copy' => 'Αντιγράφηκε!',
    'begin_start' => 'Δευτερόλεπτα από 1 Ιανουαρίου 1970. (UTC)',
    'enter_time' => 'Εισαγάγετε Timestamp',
    'enter_date' => 'Εισαγάγετε Ημερομηνία και Ώρα',
    'year' => 'Έτος',
    'month' => 'Μήνας',
    'day' => 'Ημέρα',
    'hour' => 'Ώρα',
    'hour_24h' => 'Ώρα (24ώρη)',
    'minutes' => 'Λεπτά',
    'seconds' => 'Δευτερόλεπτα',
    'format' => 'Μορφή',
    'your_time_zone' => 'Ζώνη ώρας σας',
    'relative' => 'Σχετικό',
    'what_unix' => 'Τι είναι το unix timestamp;',
    'unix_des' => 'Το unix timestamp είναι ένας τρόπος παρακολούθησης του χρόνου ως συνεχής καταμέτρηση δευτερολέπτων.
           Αυτή η καταμέτρηση ξεκινά από την Unix Epoch στις 1 Ιανουαρίου 1970, στις UTC.
           Επομένως, το unix timestamp είναι απλώς ο αριθμός των δευτερολέπτων μεταξύ μιας συγκεκριμένης ημερομηνίας και της Unix Epoch.
           Θα πρέπει επίσης να σημειωθεί (ευχαριστούμε για τα σχόλια των επισκεπτών σε αυτόν τον ιστότοπο) ότι αυτό το σημείο στο χρόνο δεν αλλάζει τεχνικά, ανεξαρτήτως της τοποθεσίας σας στον κόσμο.
           Αυτό είναι πολύ χρήσιμο για τα υπολογιστικά συστήματα για την παρακολούθηση και ταξινόμηση των δεδομένων ημερομηνίας σε δυναμικές και κατανεμημένες εφαρμογές, τόσο διαδικτυακά όσο και στην πλευρά του πελάτη.',
    'human_time' => 'Αναγνώσιμος Χρόνος',
    '1_minute' => '1 Λεπτό',
    '60_second' => '60 Δευτερόλεπτα',
    '1_hour' => '1 Ώρα',
    '3600_second' => '3600 Δευτερόλεπτα',
    '1_day' => '1 Ημέρα',
    '86400_second' => '86400 Δευτερόλεπτα',
    '1_week' => '1 Εβδομάδα',
    '604800_second' => '604800 Δευτερόλεπτα',
    '1_month' => '1 Μήνας (30.44 ημέρες)',
    '2629743_second' => '2629743 Δευτερόλεπτα',
    '1_year' => '1 Χρόνος (365.24 ημέρες)',
    '31556926_second' => '31556926 Δευτερόλεπτα',
    '2038' => 'Τι συμβαίνει στις 19 Ιανουαρίου 2038;',
    '2038_des_1' => 'Το πρόβλημα του 2038 (γνωστό και ως Y2038, Epochalypse, Y2k38 ή Unix Y2K) αφορά την αναπαράσταση του χρόνου σε πολλά ψηφιακά συστήματα ως τον αριθμό των δευτερολέπτων που έχουν περάσει από τις 00:00:00 UTC της 1ης
           Ιανουαρίου 1970 και την αποθήκευσή του ως υπογεγραμμένο ακέραιο 32-bit. Τέτοιες υλοποιήσεις δεν μπορούν να κωδικοποιήσουν χρονικές στιγμές μετά τις 03:14:07 UTC της 19ης Ιανουαρίου 2038. Όπως και το πρόβλημα του Y2K, το πρόβλημα του 2038 προκαλείται
           από ανεπαρκή ικανότητα για την αναπαράσταση του χρόνου.',
    '2038_des_2' => 'Η τελευταία χρονική στιγμή από την 1η Ιανουαρίου 1970 που μπορεί να αποθηκευτεί με υπογεγραμμένο ακέραιο 32-bit είναι 03:14:07 την Τρίτη, 19 Ιανουαρίου 2038 (231-1 = 2.147.483.647 δευτερόλεπτα από την 1η Ιανουαρίου 1970).
           Τα προγράμματα που προσπαθούν να αυξήσουν τον χρόνο πέρα από αυτήν την ημερομηνία θα προκαλέσουν την αποθήκευση της τιμής ως αρνητικό αριθμό, τον οποίο τα συστήματα αυτά θα ερμηνεύσουν ως 20:45:52 την Παρασκευή, 13 Δεκεμβρίου 1901 (2.147.483.648 δευτερόλεπτα πριν από την 1η Ιανουαρίου 1970)
           αντί για την 19η Ιανουαρίου 2038. Αυτό συμβαίνει λόγω υπερχείλισης ακέραιου, όταν ο μετρητής εξαντλεί τα διαθέσιμα ψηφία και αντιστρέφει το bit υπογραφής. Αυτό εμφανίζει τον μέγιστο αρνητικό αριθμό, και συνεχίζει να μετράει προς το μηδέν, στη συνέχεια ανεβαίνοντας ξανά μέσα από τους θετικούς ακέραιους. Τα λανθασμένα υπολογισμένα αποτελέσματα σε αυτά τα συστήματα πιθανότατα θα προκαλέσουν προβλήματα για τους χρήστες και άλλους ενδιαφερόμενους.'
];
