<?php

return [
    'title' => 'টাইমস্ট্যাম্পকে তারিখে রূপান্তর করুন - ইউনিক্স টাইমস্ট্যাম্প কনভার্সন',
    'h1' => 'ইউনিক্স টাইমস্ট্যাম্প থেকে তারিখ রূপান্তরক',
    'meta_keywords' => 'টাইমস্ট্যাম্প থেকে তারিখ রূপান্তরক',
    'meta_description' => 'আমাদের বিনামূল্যের অনলাইন টাইমস্ট্যাম্প থেকে তারিখ রূপান্তরকের সাহায্যে ইউনিক্স টাইমস্ট্যাম্প সহজেই পাঠযোগ্য তারিখে রূপান্তর করুন। দ্রুত, সঠিক এবং সহজে ব্যবহারযোগ্য।',
    'meta_title' => 'টাইমস্ট্যাম্প থেকে তারিখ রূপান্তরক - ইনস্ট্যান্ট ইউনিক্স টাইমস্ট্যাম্প কনভার্সন',
    'locale' => 'bn-BD',
    'select_language' => 'ভাষা নির্বাচন করুন',
    'summary' => 'ইউনিক্স টাইমস্ট্যাম্প সহজে রূপান্তর করুন',
    'copy_time' => 'কপি করুন',
    'done_copy' => 'কপি করা হয়েছে!',
    'begin_start' => '০১ জানুয়ারি ১৯৭০ থেকে সেকেন্ড। (UTC)',
    'enter_time' => 'টাইমস্ট্যাম্প প্রবেশ করুন',
    'enter_date' => 'তারিখ ও সময় প্রবেশ করুন',
    'year' => 'বছর',
    'month' => 'মাস',
    'day' => 'দিন',
    'hour' => 'ঘন্টা',
    'hour_24h' => 'ঘন্টা (২৪ ঘণ্টা)',
    'minutes' => 'মিনিট',
    'seconds' => 'সেকেন্ড',
    'format' => 'ফরম্যাট',
    'your_time_zone' => 'আপনার সময় অঞ্চল',
    'relative' => 'আপেক্ষিক',
    'what_unix' => 'ইউনিক্স টাইমস্ট্যাম্প কী?',
    'unix_des' => 'ইউনিক্স টাইমস্ট্যাম্প হলো সময়কে সেকেন্ডের মোট হিসাব দিয়ে অনুসরণ করার একটি পদ্ধতি।
           এই গণনা ইউনিক্স এপোক থেকে শুরু হয়, যা ১ জানুয়ারি ১৯৭০ তারিখে, UTC সময়ে।
           তাই ইউনিক্স টাইমস্ট্যাম্প হলো নির্দিষ্ট একটি তারিখ ও ইউনিক্স এপোকের মধ্যবর্তী সেকেন্ডের সংখ্যা।
           উল্লেখযোগ্য যে (এই সাইটের দর্শকদের মন্তব্যের জন্য ধন্যবাদ), এই সময় বিন্দুটি প্রকৃতপক্ষে আপনি পৃথিবীর যেখানেই থাকুন না কেন পরিবর্তিত হয় না।
           এটি কম্পিউটার সিস্টেমের জন্য তারিখের ভিত্তিতে তথ্য অনুসরণ ও সাজানোর জন্য অত্যন্ত উপকারী, অনলাইন ও ক্লায়েন্ট সাইড উভয় ক্ষেত্রেই।',
    'human_time' => 'মানুষের পাঠযোগ্য সময়',
    '1_minute' => '১ মিনিট',
    '60_second' => '৬০ সেকেন্ড',
    '1_hour' => '১ ঘন্টা',
    '3600_second' => '৩৬০০ সেকেন্ড',
    '1_day' => '১ দিন',
    '86400_second' => '৮৬৪০০ সেকেন্ড',
    '1_week' => '১ সপ্তাহ',
    '604800_second' => '৬০৪৮০০ সেকেন্ড',
    '1_month' => '১ মাস (৩০.৪৪ দিন)',
    '2629743_second' => '২৬২৯৭৪৩ সেকেন্ড',
    '1_year' => '১ বছর (৩৬৫.২৪ দিন)',
    '31556926_second' => '৩১৫৫৬৯২৬ সেকেন্ড',
    '2038' => '১৯ জানুয়ারি ২০৩৮ সালে কী ঘটবে?',
    '2038_des_1' => '২০৩৮ সালের সমস্যা (যা Y2038, Epochalypse, Y2k38 বা ইউনিক্স Y2K নামে পরিচিত) ডিজিটাল সিস্টেমে সময়কে ১ জানুয়ারি ১৯৭০, ০০:০০:০০ UTC থেকে অতিবাহিত সেকেন্ডের সংখ্যা হিসেবে উপস্থাপন
           এবং এটিকে ৩২-বিট সাইনড পূর্ণসংখ্যা হিসাবে সংরক্ষণ করার সাথে সম্পর্কিত। এই রূপান্তরগুলি ২০ জানুয়ারি ২০৩৮, UTC সময়ে ০৩:১৪:০৭ এর পরে সময় এনকোড করতে পারে না। Y2K সমস্যার মতো, ২০৩৮ সালের
           সমস্যা সময় উপস্থাপনের জন্য পর্যাপ্ত ক্ষমতার অভাবে সৃষ্ট।',
    '2038_des_2' => '১ জানুয়ারি ১৯৭০ থেকে সর্বশেষ সময় যা সাইনড ৩২-বিট পূর্ণসংখ্যা ব্যবহার করে সংরক্ষণ করা যেতে পারে, সেটি হলো মঙ্গলবার, ১৯ জানুয়ারি ২০৩৮, UTC সময়ে ০৩:১৪:০৭
           (২³¹-১ = ২,১৪৭,৪৮৩,৬৪৭ সেকেন্ড পর)। প্রোগ্রামগুলি যেগুলি এই তারিখের পরে সময় বাড়ানোর চেষ্টা করবে, এটি অভ্যন্তরীণভাবে নেতিবাচক সংখ্যা হিসাবে সংরক্ষণ করবে, যা এই সিস্টেমগুলি
           ভুলভাবে ব্যাখ্যা করবে যে এটি ঘটেছে ১৩ ডিসেম্বর ১৯০১, শুক্রবার, UTC সময়ে ২০:৪৫:৫২ (১ জানুয়ারি ১৯৭০ এর ২,১৪৭,৪৮৩,৬৪৮ সেকেন্ড আগে)। এটি পূর্ণসংখ্যার ওভারফ্লোর কারণে ঘটে,
           যেখানে কাউন্টার উপলব্ধ সংখ্যা বিট শেষ করে এবং পরিবর্তে সাইন বিট উল্টায়। এটি সর্বাধিক নেতিবাচক সংখ্যার রিপোর্ট দেয় এবং শূন্যের দিকে গণনা শুরু করে, তারপর ইতিবাচক সংখ্যাগুলি অতিক্রম করে চলতে থাকে।
           এই ধরনের ভুল গণনাগুলি ব্যবহারকারী এবং অন্যান্য নির্ভরশীল পক্ষগুলির জন্য সমস্যার কারণ হতে পারে।'
];
