<?php

return [
    'title' => 'Конвертиране на времеви печат в дата - Unix времеви печат конверсия',
    'h1' => 'Конвертор на Unix времеви печат в дата',
    'meta_keywords' => 'конвертор на времеви печат в дата',
    'meta_description' => 'Лесно конвертирайте Unix времеви печати в четими дати с нашия безплатен онлайн конвертор. Бързо, точно и лесно за използване.',
    'meta_title' => 'Конвертор на времеви печат в дата - Незабавна Unix времеви печат конверсия',
    'locale' => 'bg-BG',
    'select_language' => 'Изберете език',
    'summary' => 'Лесно конвертирайте Unix времеви печати',
    'copy_time' => 'Копирай',
    'done_copy' => 'Копирано!',
    'begin_start' => 'Секунди от 01 януари 1970 г. (UTC)',
    'enter_time' => 'Въведете времеви печат',
    'enter_date' => 'Въведете дата и час',
    'year' => 'Година',
    'month' => 'Месец',
    'day' => 'Ден',
    'hour' => 'Час',
    'hour_24h' => 'Час (24 ч)',
    'minutes' => 'Минути',
    'seconds' => 'Секунди',
    'format' => 'Формат',
    'your_time_zone' => 'Вашата часова зона',
    'relative' => 'Относително',
    'what_unix' => 'Какво представлява Unix времевият печат?',
    'unix_des' => 'Unix времевият печат е начин за проследяване на времето чрез броене на секунди.
           Този брояч започва от Unix Епохата, 1 януари 1970 г., в UTC време.
           Времевият печат е броят секунди между определена дата и Unix Епохата.
           Струва си да се отбележи (благодарение на коментарите на посетителите на този сайт), че тази времева точка технически не се променя, независимо къде се намирате в света.
           Това е много полезно за компютърните системи за проследяване и сортиране на данни по дати в динамични и разпределени приложения както онлайн, така и на страната на клиента.',
    'human_time' => 'Четимо за хора време',
    '1_minute' => '1 минута',
    '60_second' => '60 секунди',
    '1_hour' => '1 час',
    '3600_second' => '3600 секунди',
    '1_day' => '1 ден',
    '86400_second' => '86400 секунди',
    '1_week' => '1 седмица',
    '604800_second' => '604800 секунди',
    '1_month' => '1 месец (30,44 дни)',
    '2629743_second' => '2629743 секунди',
    '1_year' => '1 година (365,24 дни)',
    '31556926_second' => '31556926 секунди',
    '2038' => 'Какво ще се случи на 19 януари 2038 г.?',
    '2038_des_1' => 'Проблемът с 2038 г. (известен също като Y2038, Epochalypse, Y2k38 или Unix Y2K) е свързан с представянето на времето в много цифрови системи като броя секунди от 00:00:00 UTC
           на 1 януари 1970 г. и съхраняването му като знаков 32-битов цяло число. Такива реализации не могат да кодират времена след 03:14:07 UTC на 19 януари 2038 г.
           Подобно на проблема Y2K, проблемът с 2038 г. е причинен от недостатъчен капацитет за представяне на времето.',
    '2038_des_2' => 'Най-късното време от 1 януари 1970 г., което може да бъде съхранено с помощта на знаков 32-битов цяло число, е 03:14:07 на 19 януари 2038 г. (2³¹-1 = 2 147 483 647 секунди след 1 януари 1970 г.).
           Програмите, които се опитват да увеличат времето след тази дата, ще съхраняват стойността вътрешно като отрицателно число, което тези системи ще интерпретират като възникнало на
           13 декември 1901 г. в 20:45:52 (2 147 483 648 секунди преди 1 януари 1970 г.), вместо на 19 януари 2038 г. Това се причинява от препълване на цяло число, при което броячът изчерпва наличните битове и обръща знаковия бит.
           В резултат на това възникват грешни изчисления, които вероятно ще създадат проблеми за потребителите и други заинтересовани страни.'
];
