<?php

return [
    'title' => 'ટાઇમસ્ટેમ્પને તારીખમાં રૂપાંતરિત કરો - યુનિક્સ ટાઇમસ્ટેમ્પ રૂપાંતરણ',
    'h1' => 'યુનિક્સ ટાઇમસ્ટેમ્પથી તારીખ રૂપાંતરક',
    'meta_keywords' => 'ટાઇમસ્ટેમ્પથી તારીખ રૂપાંતરક',
    'meta_description' => 'આપણા મફત ઑનલાઇન ટાઇમસ્ટેમ્પથી તારીખ રૂપાંતરક સાથે યુનિક્સ ટાઇમસ્ટેમ્પને સરળતાથી વાંચી શકાય એવી તારીખોમાં રૂપાંતરિત કરો. ઝડપી, સચોટ અને ઉપયોગમાં સરળ.',
    'meta_title' => 'ટાઇમસ્ટેમ્પથી તારીખ રૂપાંતરક - તરત જ યુનિક્સ ટાઇમસ્ટેમ્પ રૂપાંતરણ',
    'locale' => 'gu-IN',
    'select_language' => 'ભાષા પસંદ કરો',
    'summary' => 'યુનિક્સ ટાઇમસ્ટેમ્પને સરળતાથી રૂપાંતરિત કરો',
    'copy_time' => 'પટ્ટી',
    'done_copy' => 'પટ્ટી લો!',
    'begin_start' => '1 જાન્યુઆરી 1970 થી સેકન્ડ. (UTC)',
    'enter_time' => 'ટાઇમસ્ટેમ્પ દાખલ કરો',
    'enter_date' => 'તારીખ અને સમય દાખલ કરો',
    'year' => 'વર્ષ',
    'month' => 'મહિનો',
    'day' => 'દિવસ',
    'hour' => 'ઘંટો',
    'hour_24h' => 'ઘંટો (24 કલાક)',
    'minutes' => 'મિનિટો',
    'seconds' => 'સેકન્ડ',
    'format' => 'રૂપાંતરણ',
    'your_time_zone' => 'તમારો સમય ક્ષેત્ર',
    'relative' => 'સંપર્કિત',
    'what_unix' => 'યુનિક્સ ટાઇમસ્ટેમ્પ શું છે?',
    'unix_des' => 'યુનિક્સ ટાઇમસ્ટેમ્પ એ સમયને સેકન્ડની દ્રષ્ટિએ ટ્રેક કરવાની રીત છે.
           આ ગણતરી 1 જાન્યુઆરી 1970ના રોજ UTC પર યુનિક્સ એપોચથી શરૂ થાય છે.
           આ રીતે, યુનિક્સ ટાઇમસ્ટેમ્પ એ વૈશ્વિક ક્ષેત્ર પર તમારા સ્થાનના અભાવથી ટાઇમ સ્ટેમ્પના મૂલ્યમાં ફેરફાર કર્યા વિના એક ચોક્કસ તારીખ અને યુનિક્સ એપોચ વચ્ચેના સેકન્ડોની સંખ્યા છે.
           આ સંકલન સામાન્ય રીતે કમ્પ્યુટર સિસ્ટમો માટે ઉપયોગી છે જે ડેટેડ માહિતી ટ્રેક અને સૉર્ટ કરી શકે છે, જે ઍનલાઇન અને ક્લાઈન્ટ-સાઇડ એપ્લિકેશનોમાં ઉપયોગી છે.',
    'human_time' => 'માનવ દ્વારા વાંચી શકાયો સમય',
    '1_minute' => '1 મિનિટ',
    '60_second' => '60 સેકન્ડ',
    '1_hour' => '1 કલાક',
    '3600_second' => '3600 સેકન્ડ',
    '1_day' => '1 દિવસ',
    '86400_second' => '86400 સેકન્ડ',
    '1_week' => '1 અઠવાડિયું',
    '604800_second' => '604800 સેકન્ડ',
    '1_month' => '1 મહિનો (30.44 દિવસ)',
    '2629743_second' => '2629743 સેકન્ડ',
    '1_year' => '1 વર્ષ (365.24 દિવસ)',
    '31556926_second' => '31556926 સેકન્ડ',
    '2038' => '19 જાન્યુઆરી 2038 ના રોજ શું બનશે?',
    '2038_des_1' => '2038 વર્ષની સમસ્યા (જેને Y2038, Epochalypse, Y2k38 અથવા Unix Y2K તરીકે પણ ઓળખવામાં આવે છે) એ માન્યતા છે કે સમયના અંકોના પ્રમાણ તરીકે સમયને દર્શાવતી અનેક ડિજિટલ સિસ્ટમો માટે
           સેકન્ડની સંખ્યા માન્ય ગણાવવામાં આવે છે. ત્યારબાદ 2038ની તારીખ પછી તે તારીખની ગણતરી શક્ય નથી.',
    '2038_des_2' => '19 જાન્યુઆરી 2038ના રોજ 03:14:07 પર સેકન્ડનો લાભ લેવા માટે સૌથી વધુ પ્રમાણિત માપ છે જે 1 જાન્યુઆરી 1970 પછી દ્રષ્ટિએ દરેક સમયખંડ મર્યાદિત કરવાનું થાય છે.
           આ દિવસે મોટા પ્રમાણમાં સીમા નમાવ્યા છે, જ્યાં અનુકૂળ અર્થઘટન માટે કેટલીક નવિનસંખ્યાઓથી મર્યાદા બેસી રહી છે. '
];
