<?php

return [
    'title' => 'تحويل الطابع الزمني إلى تاريخ - تحويل طابع Unix الزمني',
    'h1' => 'أداة تحويل طابع Unix الزمني إلى تاريخ',
    'meta_keywords' => 'أداة تحويل الطابع الزمني إلى تاريخ',
    'meta_description' => 'حوّل بسهولة الطابع الزمني لنظام Unix إلى تاريخ مقروء باستخدام أداتنا المجانية عبر الإنترنت لتحويل الطوابع الزمنية إلى تواريخ. سريع، دقيق، وسهل الاستخدام.',
    'meta_title' => 'أداة تحويل الطابع الزمني إلى تاريخ - تحويل طابع Unix الزمني فورًا',
    'locale' => 'ar-SA',
    'select_language' => 'اختر اللغة',
    'summary' => 'حوّل بسهولة الطابع الزمني لنظام Unix',
    'copy_time' => 'نسخ',
    'done_copy' => 'تم النسخ!',
    'begin_start' => 'الثواني منذ 1 يناير 1970 (UTC)',
    'enter_time' => 'أدخل الطابع الزمني',
    'enter_date' => 'أدخل التاريخ والوقت',
    'year' => 'السنة',
    'month' => 'الشهر',
    'day' => 'اليوم',
    'hour' => 'الساعة',
    'hour_24h' => 'الساعة (24 ساعة)',
    'minutes' => 'الدقائق',
    'seconds' => 'الثواني',
    'format' => 'التنسيق',
    'your_time_zone' => 'المنطقة الزمنية الخاصة بك',
    'relative' => 'نسبي',
    'what_unix' => 'ما هو الطابع الزمني لنظام Unix؟',
    'unix_des' => 'الطابع الزمني لنظام Unix هو طريقة لتتبع الوقت كمجموع إجمالي للثواني.
           يبدأ هذا العد من حقبة Unix في 1 يناير 1970 بتوقيت UTC.
           وبالتالي، فإن الطابع الزمني لنظام Unix هو ببساطة عدد الثواني بين تاريخ معين وحقبة Unix.
           ومن الجدير بالذكر (بفضل تعليقات زوار هذا الموقع) أن هذه النقطة الزمنية لا تتغير تقنيًا بغض النظر عن مكانك على الكرة الأرضية.
           هذا مفيد جدًا لأنظمة الحاسوب لتتبع وفرز المعلومات المؤرخة في التطبيقات الديناميكية والموزعة عبر الإنترنت وعلى جانب العميل.',
    'human_time' => 'الوقت المقروء للإنسان',
    '1_minute' => '1 دقيقة',
    '60_second' => '60 ثانية',
    '1_hour' => '1 ساعة',
    '3600_second' => '3600 ثانية',
    '1_day' => '1 يوم',
    '86400_second' => '86400 ثانية',
    '1_week' => '1 أسبوع',
    '604800_second' => '604800 ثانية',
    '1_month' => '1 شهر (30.44 يومًا)',
    '2629743_second' => '2629743 ثانية',
    '1_year' => '1 سنة (365.24 يومًا)',
    '31556926_second' => '31556926 ثانية',
    '2038' => 'ماذا سيحدث في 19 يناير 2038؟',
    '2038_des_1' => 'مشكلة عام 2038 (تُعرف أيضًا باسم Y2038 أو Epochalypse أو Y2k38 أو Unix Y2K) تتعلق بتمثيل الوقت في العديد من الأنظمة الرقمية كمجموع الثواني منذ 00:00:00 بتوقيت UTC في
           1 يناير 1970 وتخزينها كعدد صحيح موقّع 32 بت. لا يمكن لهذه التطبيقات ترميز الأوقات بعد 03:14:07 بتوقيت UTC في 19 يناير 2038. مشابهة لمشكلة Y2K، مشكلة عام 2038
           سببها عدم كفاية السعة المستخدمة لتمثيل الوقت.',
    '2038_des_2' => 'أحدث وقت منذ 1 يناير 1970 يمكن تخزينه باستخدام عدد صحيح موقّع 32 بت هو 03:14:07 يوم الثلاثاء، 19 يناير 2038 (231-1 = 2,147,483,647 ثانية بعد 1 يناير 1970). البرامج
           التي تحاول زيادة الوقت بعد هذا التاريخ ستؤدي إلى تخزين القيمة داخليًا كرقم سلبي، والذي ستفسره هذه الأنظمة على أنه حدث في الساعة 20:45:52
           يوم الجمعة، 13 ديسمبر 1901 (2,147,483,648 ثانية قبل 1 يناير 1970) بدلاً من 19 يناير 2038. يحدث هذا بسبب تجاوز سعة العدد الصحيح، حيث ينفد العداد من البتات الصالحة، وينقلب بت الإشارة بدلًا من ذلك.
           يؤدي هذا إلى الإبلاغ عن أكبر رقم سلبي، ويستمر العد حتى الصفر، ثم يصعد عبر الأرقام الإيجابية مرة أخرى. الحسابات الخاطئة الناتجة عن ذلك في هذه الأنظمة قد تسبب مشاكل للمستخدمين والأطراف الأخرى ذات الصلة.'
];
