<?php

return [
    'title' => 'Փոխարկել Timestamp-ը ամսաթվի - Unix Timestamp-ի փոխարկում',
    'h1' => 'Unix Timestamp-ը ամսաթվի փոխարկիչ',
    'meta_keywords' => 'timestamp-ը ամսաթվի փոխարկիչ',
    'meta_description' => 'Հեշտությամբ փոխարկեք Unix timestamp-ը ընթեռնելի ամսաթվերի մեր անվճար առցանց timestamp-ը ամսաթվի փոխարկիչով: Արագ, ճշգրիտ և պարզ օգտագործման համար:',
    'meta_title' => 'Timestamp-ը ամսաթվի փոխարկիչ - Անմիջական Unix Timestamp-ի փոխարկում',
    'locale' => 'hy-AM',
    'select_language' => 'Ընտրեք Լեզուն',
    'summary' => 'Հեշտությամբ փոխարկեք Unix timestamp-ը',
    'copy_time' => 'Պատճենել',
    'done_copy' => 'Պատճենված է!',
    'begin_start' => 'Վայրկյաններ 1970թ. հունվարի 01-ից սկսած (UTC)',
    'enter_time' => 'Մուտքագրեք Timestamp',
    'enter_date' => 'Մուտքագրեք Ամսաթիվ և Ժամ',
    'year' => 'Տարի',
    'month' => 'Ամիս',
    'day' => 'Օր',
    'hour' => 'Ժամ',
    'hour_24h' => 'Ժամ (24-ժամյա)',
    'minutes' => 'Րոպե',
    'seconds' => 'Վայրկյան',
    'format' => 'Ձևաչափ',
    'your_time_zone' => 'Ձեր Ժամային Գոտին',
    'relative' => 'Հարաբերական',
    'what_unix' => 'Ինչ է Unix Timestamp-ը?',
    'unix_des' => 'Unix timestamp-ը ժամանակի հետևման մեթոդ է վայրկյանների գումարային հաշվարկի միջոցով:
           Այս հաշվարկը սկսվում է Unix Epoch-ից՝ 1970թ. հունվարի 1-ին, UTC-ի ժամանակով:
           Unix timestamp-ը պարզապես վայրկյանների թիվն է տվյալ ամսաթվի և Unix Epoch-ի միջև:
           Պետք է նշել (շնորհիվ այս կայքի այցելուների մեկնաբանությունների), որ այս ժամանակային կետը տեխնիկապես չի փոխվում՝ անկախ ձեր գտնվելու վայրից:
           Սա շատ օգտակար է համակարգիչների համար՝ ժամանակի վրա հիմնված տվյալների հետևման և տեսակավորման համար՝ դինամիկ և տարածված ծրագրերում՝ թե՛ առցանց, թե՛ հաճախորդի կողմում:',
    'human_time' => 'Մարդու ընթեռնելի ժամանակ',
    '1_minute' => '1 րոպե',
    '60_second' => '60 վայրկյան',
    '1_hour' => '1 ժամ',
    '3600_second' => '3600 վայրկյան',
    '1_day' => '1 օր',
    '86400_second' => '86400 վայրկյան',
    '1_week' => '1 շաբաթ',
    '604800_second' => '604800 վայրկյան',
    '1_month' => '1 ամիս (30.44 օր)',
    '2629743_second' => '2629743 վայրկյան',
    '1_year' => '1 տարի (365.24 օր)',
    '31556926_second' => '31556926 վայրկյան',
    '2038' => 'Ի՞նչ տեղի կունենա 2038թ. հունվարի 19-ին:',
    '2038_des_1' => '2038թ. խնդիրը (որը նաև կոչվում է Y2038, Epochalypse, Y2k38 կամ Unix Y2K) վերաբերում է շատ թվային համակարգերում ժամանակը ներկայացնելուն՝ որպես վայրկյանների թիվ, որը անցել է 1970թ. հունվարի 1-ից
           00:00:00 UTC-ի ժամանակից ի վեր, և այն պահել որպես ստորագրված 32-բիթանոց ամբողջ թիվ: Նման իրականացումներն ի վիճակի չեն կոդավորել 2038թ. հունվարի 19-ին՝ 03:14:07 UTC-ից հետո ժամանակները: Նմանապես Y2K-ի
           խնդրին, 2038թ. խնդիրը պայմանավորված է ժամանակը ներկայացնելու համար օգտագործվող անբավարար հզորությամբ:',
    '2038_des_2' => '1970թ. հունվարի 1-ից ի վեր հնարավոր է ստորագրված 32-բիթանոց ամբողջ թվով պահվող վերջին ժամանակը՝ 2038թ. հունվարի 19-ին, երեքշաբթի՝ 03:14:07 (2³¹-1 = 2,147,483,647 վայրկյան հետո 1970թ. հունվարի 1-ից): Ծրագրերը, որոնք
           կփորձեն ժամանակը ավելացնել այս ամսաթվից հետո, կպահպանեն արժեքը որպես բացասական թիվ, որը համակարգերը կընկալեն որպես 1901թ. դեկտեմբերի 13-ին՝ ուրբաթ օրը՝ 20:45:52 (2,147,483,648 վայրկյան առաջ 1970թ. հունվարի 1-ից),
           այլ ոչ թե 2038թ. հունվարի 19: Սա պայմանավորված է ամբողջ թվերի գերբեռնվածությամբ, որի ընթացքում հաշվիչը սպառում է մատչելի թվային բիթերը և փոխում նշանի բիթը: Սա հաշվետվություն է տալիս առավել բացասական թվի մասին և շարունակում է հաշվել՝
           զրոյի ուղղությամբ, այնուհետև անցնելով դրական թվերի միջով: Նման սխալ հաշվարկները հավանական է, որ խնդիրներ կստեղծեն օգտատերերի և կախյալ կողմերի համար:'
];
