<?php

return [
    'title' => 'Timestamp-ის გადაყვანა თარიღად - Unix Timestamp-ის კონვერტაცია',
    'h1' => 'Unix Timestamp-დან თარიღად გადამყვანი',
    'meta_keywords' => 'timestamp-დან თარიღზე კონვერტერი',
    'meta_description' => 'ფასოად გადაიყვანეთ Unix timestamp-ები გასაგებ თარიღებში ჩვენი უფასო ონლაინ timestamp-დან თარიღზე კონვერტერის დახმარებით. სწრაფი, ზუსტი და მარტივი გამოყენება.',
    'meta_title' => 'Timestamp-დან თარიღზე კონვერტერი - პირდაპირი Unix Timestamp კონვერტაცია',
    'locale' => 'ka-GE',
    'select_language' => 'აირჩიეთ ენა',
    'summary' => 'მარტივად გადაყვანეთ Unix timestamp-ები',
    'copy_time' => 'კოპირება',
    'done_copy' => 'კოპირებული!',
    'begin_start' => 'წამები 1970 წლის 1 იანვრიდან. (UTC)',
    'enter_time' => 'შეიყვანეთ Timestamp',
    'enter_date' => 'შეიყვანეთ თარიღი და დრო',
    'year' => 'წელი',
    'month' => 'თვე',
    'day' => 'დღე',
    'hour' => 'საათი',
    'hour_24h' => 'საათი (24 საათიანი)',
    'minutes' => 'წუთები',
    'seconds' => 'წამები',
    'format' => 'ფორმატი',
    'your_time_zone' => 'თქვენი დროის ზონა',
    'relative' => 'შედარებითი',
    'what_unix' => 'რა არის unix timestamp?',
    'unix_des' => 'Unix timestamp არის დროის დათვლის მეთოდი, რომელიც აღიქვამს დროს, როგორც მიმდინარე წამების ჯამს.
           ეს გამოთვლა იწყება Unix ეპოქიდან 1970 წლის 1 იანვარს UTC დროს.
           ამიტომ, unix timestamp უბრალოდ არის წამების რაოდენობა კონკრეტულ თარიღსა და Unix ეპოქას შორის.
           ასევე, უნდა აღინიშნოს (მადლობა ამ საიტის კომენტარებს), რომ ეს დროის წერტილი ტექნიკურად არ იცვლება იმ ადგილმდებარეობის მიუხედავად, სადაც იმყოფებით მსოფლიოს რუკაზე.
           ეს ძალიან სასარგებლოა კომპიუტერული სისტემებისთვის, რადგან ის აძლევს შესაძლებლობას, გააკონტროლონ და დაალაგონ დათარიღებული ინფორმაცია დინამიკურ და განაწილებულ აპლიკაციებში, როგორც ონლაინ, ასევე კლიენტთან მხარეზე.',
    'human_time' => 'ადამიანის მიერ წასაკითხი დრო',
    '1_minute' => '1 წუთი',
    '60_second' => '60 წამი',
    '1_hour' => '1 საათი',
    '3600_second' => '3600 წამი',
    '1_day' => '1 დღე',
    '86400_second' => '86400 წამი',
    '1_week' => '1 კვირა',
    '604800_second' => '604800 წამი',
    '1_month' => '1 თვე (30.44 დღე)',
    '2629743_second' => '2629743 წამი',
    '1_year' => '1 წელი (365.24 დღე)',
    '31556926_second' => '31556926 წამი',
    '2038' => 'რა მოხდება 2038 წლის 19 იანვარს?',
    '2038_des_1' => '2038 წლის პრობლემა (მეტსახელად Y2038, Epochalypse, Y2k38 ან Unix Y2K) ეხება დროს მრავალრიცხოვან ციფრულ სისტემებში, რომელიც გამოიყენება წამების რაოდენობის სახით
           1970 წლის 1 იანვრის 00:00:00 UTC-ს და ინახება 32-ბიტიან, დადებით ენდო-ნეგატიურ ციფრად. ასეთი დანადგარები ვერ შეძლებენ ჩაწერონ დრო 19 იანვარს 2038 წელს UTC-ის 03:14:07-დან.
           როგორც Y2K პრობლემა, 2038 წლის პრობლემა გამოწვეულია დროის გამოსახვისთვის გამოყოფილი არასაკმარისი რესურსებით.',
    '2038_des_2' => '1970 წლის 1 იანვრის შემდეგ, რაც შესაძლებელია ჩაწეროს 32-ბიტიანი დადებითი ნომრით, არის 2038 წლის 19 იანვარი, 03:14:07 (231-1 = 2,147,483,647 წამი 1970 წლის 1 იანვრის შემდეგ).
           პროგრამები, რომლებიც ცდილობენ დროის გაზრდას ამ თარიღის შემდეგ, გამოიწვევენ ღირებულების შენახვას უარყოფით რიცხვად, რომელსაც ეს სისტემები ინტერპრეტირებენ, როგორც 1901 წლის 13 დეკემბერს, 20:45:52-ზე (2,147,483,648 წამი 1970 წლის 1 იანვრის წინ) ნაცვლად 2038 წლის 19 იანვრის.
           ეს ხდება ინფლაციო სხეულით, როდესაც გადის ციფრებისა და შეცვლის ნიშნის ბიტები. ეს ართულებს მაქსიმალურად უარყოფითი რიცხვის მონიშნვას და ის კვლავ მიემართება მინუსი და ზრდის დადებით ციფრებში, რაც შედეგად გამოიწვევს შეცდომების ნაკადის პრობლემებს.'
];
