<?php

return [
    'title' => 'Unix TimeStamp - Epoch Converter - TimeStamp Converter',
    'h1' => 'تبدیل‌کننده زمان‌مهر یونیکس به تاریخ',
    'meta_keywords' => 'تبدیل‌کننده زمان‌مهر به تاریخ',
    'meta_description' => 'Unix TimeStamp - به راحتی زمان‌مهرهای یونیکس را به تاریخ‌های قابل خواندن با استفاده از تبدیل‌کننده آنلاین رایگان ما تبدیل کنید. سریع، دقیق و آسان برای استفاده.',
    'meta_title' => 'تبدیل‌کننده زمان‌مهر به تاریخ - تبدیل فوری زمان‌مهر یونیکس',
    'locale' => 'fa-AF',
    'select_language' => 'زبان را انتخاب کنید',
    'summary' => 'به راحتی زمان‌مهرهای یونیکس را تبدیل کنید',
    'copy_time' => 'کپی',
    'done_copy' => 'کپی شد!',
    'begin_start' => 'ثانیه‌ها از 1 ژانویه 1970 (UTC)',
    'enter_time' => 'یک زمان‌مهر وارد کنید',
    'enter_date' => 'یک تاریخ و زمان وارد کنید',
    'year' => 'سال',
    'month' => 'ماه',
    'day' => 'روز',
    'hour' => 'ساعت',
    'hour_24h' => 'ساعت (24 ساعته)',
    'minutes' => 'دقیقه',
    'seconds' => 'ثانیه',
    'format' => 'فرمت',
    'your_time_zone' => 'منطقه زمانی شما',
    'relative' => 'نسبی',
    'what_unix' => 'زمان‌مهر یونیکس چیست؟',
    'unix_des' => 'زمان‌مهر یونیکس روشی برای ردیابی زمان به صورت جمعی از ثانیه‌ها است.
           این شمارش از عصر یونیکس در 1 ژانویه 1970 (UTC) شروع می‌شود.
           بنابراین، زمان‌مهر یونیکس فقط تعداد ثانیه‌ها بین یک تاریخ خاص و عصر یونیکس است.
           باید ذکر شود (با تشکر از نظرات بازدیدکنندگان این سایت) که این نقطه زمانی از نظر فنی هیچ تغییری نمی‌کند، صرف‌نظر از اینکه در کجا در جهان قرار دارید.
           این امر برای سیستم‌های کامپیوتری بسیار مفید است تا اطلاعات مربوط به تاریخ‌ها را در برنامه‌های پویا و توزیع‌شده، چه آنلاین و چه در سمت مشتری، پیگیری و مرتب‌سازی کنند.',
    'human_time' => 'زمان قابل خواندن برای انسان',
    '1_minute' => '1 دقیقه',
    '60_second' => '60 ثانیه',
    '1_hour' => '1 ساعت',
    '3600_second' => '3600 ثانیه',
    '1_day' => '1 روز',
    '86400_second' => '86400 ثانیه',
    '1_week' => '1 هفته',
    '604800_second' => '604800 ثانیه',
    '1_month' => '1 ماه (30.44 روز)',
    '2629743_second' => '2629743 ثانیه',
    '1_year' => '1 سال (365.24 روز)',
    '31556926_second' => '31556926 ثانیه',
    '2038' => 'چه چیزی در 19 ژانویه 2038 اتفاق می‌افتد؟',
    '2038_des_1' => 'مسئله سال 2038 (که به Y2038، Epochalypse، Y2k38 یا Unix Y2K نیز معروف است) مربوط به نمایش زمان در بسیاری از سیستم‌های دیجیتال است که به عنوان تعداد ثانیه‌هایی که از 00:00:00 UTC 1
           ژانویه 1970 گذشته‌اند، ذخیره می‌شود و به‌عنوان یک عدد صحیح 32 بیتی امضاء شده ذخیره می‌شود. چنین پیاده‌سازی‌هایی نمی‌توانند زمان‌هایی پس از 03:14:07 UTC 19 ژانویه 2038 را کدگذاری کنند.
           مشابه مشکل Y2K، مشکل سال 2038 به دلیل ظرفیت ناکافی برای نمایش زمان است.',
    '2038_des_2' => 'آخرین زمانی که از 1 ژانویه 1970 می‌تواند با استفاده از یک عدد صحیح 32 بیتی امضاء شده ذخیره شود، 19 ژانویه 2038 در 03:14:07 است
           (2³¹-1 = 2,147,483,647 ثانیه پس از 1 ژانویه 1970). برنامه‌هایی که سعی می‌کنند زمان را پس از این تاریخ افزایش دهند، باعث می‌شوند که مقدار به‌صورت داخلی به‌عنوان یک عدد منفی ذخیره شود،
           که این سیستم‌ها آن را به‌عنوان وقوع در 13 دسامبر 1901 ساعت 20:45:52 (2,147,483,648 ثانیه قبل از 1 ژانویه 1970) تفسیر خواهند کرد، نه 19 ژانویه 2038.
           این به‌دلیل سرریز عدد صحیح است، زمانی که شمارنده از بیت‌های قابل استفاده برای ارقام خارج می‌شود و به‌جای آن بیت علامت را تغییر می‌دهد. این یک عدد منفی حداکثری گزارش می‌کند و به‌شمارش خود ادامه می‌دهد، به سمت صفر و سپس دوباره به سمت اعداد صحیح مثبت.
           محاسبات اشتباهی در چنین سیستم‌هایی احتمالاً باعث مشکلاتی برای کاربران و سایر طرف‌های وابسته خواهد شد.'
];
