<?php

return [
    'title' => 'המרת Timestamp לתאריך - המרת Unix Timestamp',
    'h1' => 'המרת Unix Timestamp לתאריך',
    'meta_keywords' => 'המרת timestamp לתאריך',
    'meta_description' => 'המרה בקלות של Unix timestamps לתאריכים קריאים בעזרת הממיר חינם שלנו באינטרנט. מהיר, מדויק וקל לשימוש.',
    'meta_title' => 'ממיר Timestamp לתאריך - המרת Unix Timestamp מיידית',
    'locale' => 'he-IL',
    'select_language' => 'בחר שפה',
    'summary' => 'המרה קלה של Unix timestamps',
    'copy_time' => 'העתק',
    'done_copy' => 'הועתק!',
    'begin_start' => 'שניות מאז 1 בינואר 1970. (UTC)',
    'enter_time' => 'הכנס Timestamp',
    'enter_date' => 'הכנס תאריך ושעה',
    'year' => 'שנה',
    'month' => 'חודש',
    'day' => 'יום',
    'hour' => 'שעה',
    'hour_24h' => 'שעה (24h)',
    'minutes' => 'דקות',
    'seconds' => 'שניות',
    'format' => 'פורמט',
    'your_time_zone' => 'אזור הזמן שלך',
    'relative' => 'יחסי',
    'what_unix' => 'מהו Unix timestamp?',
    'unix_des' => 'Unix timestamp הוא דרך לעקוב אחרי זמן על ידי חיבור סך השניות.
           החישוב מתחיל מ- Unix Epoch ב- 1 בינואר 1970 ב- UTC.
           לכן, ה- Unix timestamp הוא פשוט מספר השניות שעברו מאז תאריך מסוים ועד ל- Unix Epoch.
           כדאי גם לציין (תודה להערות מבקרים באתר זה) כי נקודת הזמן הזו לא משתנה מבחינה טכנית לא משנה היכן אתה נמצא בעולם.
           זה מאוד שימושי עבור מערכות מחשוב לעקוב ולמיין מידע בזמן באפליקציות דינמיות ומפוזרות, הן באינטרנט והן בצד הלקוח.',
    'human_time' => 'זמן קריא על ידי אדם',
    '1_minute' => 'דקה אחת',
    '60_second' => '60 שניות',
    '1_hour' => 'שעה אחת',
    '3600_second' => '3600 שניות',
    '1_day' => 'יום אחד',
    '86400_second' => '86400 שניות',
    '1_week' => 'שבוע אחד',
    '604800_second' => '604800 שניות',
    '1_month' => 'חודש אחד (30.44 ימים)',
    '2629743_second' => '2629743 שניות',
    '1_year' => 'שנה אחת (365.24 ימים)',
    '31556926_second' => '31556926 שניות',
    '2038' => 'מה יקרה ב- 19 בינואר 2038?',
    '2038_des_1' => 'הבעיה של שנת 2038 (נקראת גם Y2038, Epochalypse, Y2k38, או Unix Y2K) קשורה לייצוג זמן במערכות דיגיטליות רבות ככמות השניות שחלפו מאז 00:00:00 UTC ב- 1 בינואר 1970
           ואחסנתן כמספר שלם 32-ביט עם סימן. יישומים כאלה לא יכולים לקודד זמנים אחרי השעה 03:14:07 UTC ב- 19 בינואר 2038. בדומה לבעיה של Y2K, בעיית שנת 2038
           נגרמת בגלל חוסר קיבולת בייצוג הזמן.',
    '2038_des_2' => 'הזמן המאוחר ביותר מאז 1 בינואר 1970 שניתן לאחסן באמצעות מספר שלם 32-ביט עם סימן הוא 03:14:07 ביום שלישי, 19 בינואר 2038 (231-1 = 2,147,483,647 שניות אחרי 1 בינואר 1970).
           תוכניות שינסו להוסיף זמן מעבר לתאריך הזה יגרמו לאחסון הערך כמספר שלילי, שמערכות אלה יתפרשו כ- 20:45:52 ביום שישי, 13 בדצמבר 1901 (2,147,483,648 שניות לפני 1 בינואר 1970)
           במקום 19 בינואר 2038. זה קורה בגלל overflow של מספרים שלמים, שבו המונה יוצא מהתחום של הספרות הניתנות לשימוש, ומפנה את ביט הסימן במקום. זה מדווח על מספר שלילי מקסימלי,
           ואז המונה ממשיך לספור לכיוון אפס, ואז חוזר למספרים החיוביים. חישובים שגויים במערכות כאלה צפויים לגרום לבעיות למשתמשים ולצדדים תלויים אחרים.',
];
