<?php

return [
    'title' => 'Timestamp को Date में बदलें - Unix Timestamp रूपांतरण',
    'h1' => 'Unix Timestamp से Date कनवर्टर',
    'meta_keywords' => 'timestamp से date कनवर्टर',
    'meta_description' => 'हमारे मुफ्त ऑनलाइन timestamp से date कनवर्टर के साथ आसानी से Unix timestamps को पठनीय तारीखों में बदलें। तेज़, सटीक, और उपयोग में आसान।',
    'meta_title' => 'Timestamp से Date कनवर्टर - तत्काल Unix Timestamp रूपांतरण',
    'locale' => 'hi-IN',
    'select_language' => 'भाषा चुनें',
    'summary' => 'आसानी से Unix timestamps को बदलें',
    'copy_time' => 'कॉपी करें',
    'done_copy' => 'कॉपी हो गया!',
    'begin_start' => '1 जनवरी 1970 से सेकंड। (UTC)',
    'enter_time' => 'Timestamp दर्ज करें',
    'enter_date' => 'तारीख और समय दर्ज करें',
    'year' => 'वर्ष',
    'month' => 'महीना',
    'day' => 'दिन',
    'hour' => 'घंटा',
    'hour_24h' => 'घंटा (24 घंटे)',
    'minutes' => 'मिनट',
    'seconds' => 'सेकंड',
    'format' => 'फ़ॉर्मेट',
    'your_time_zone' => 'आपका समय क्षेत्र',
    'relative' => 'सापेक्ष',
    'what_unix' => 'Unix टाइमस्टैम्प क्या है?',
    'unix_des' => 'Unix टाइमस्टैम्प एक तरीका है समय को सेकंड के कुल के रूप में ट्रैक करने का।
           यह गिनती 1 जनवरी 1970 को UTC पर Unix Epoch से शुरू होती है।
           इसलिए, Unix टाइमस्टैम्प सिर्फ उस विशिष्ट तारीख और Unix Epoch के बीच सेकंड की संख्या है।
           यह भी बताया जाना चाहिए (इस साइट पर आगंतुकों की टिप्पणियों के लिए धन्यवाद) कि यह समय का बिंदु तकनीकी रूप से उस स्थान पर नहीं बदलता है, चाहे आप दुनिया में कहीं भी हों।
           यह कंप्यूटर प्रणालियों के लिए बहुत उपयोगी है क्योंकि यह डायनेमिक और वितरित अनुप्रयोगों में तिथिवध जानकारी को ट्रैक और सॉर्ट करने के लिए सहायक होता है, चाहे वह ऑनलाइन हो या क्लाइंट-साइड।',
    'human_time' => 'मानव-पठनीय समय',
    '1_minute' => '1 मिनट',
    '60_second' => '60 सेकंड',
    '1_hour' => '1 घंटा',
    '3600_second' => '3600 सेकंड',
    '1_day' => '1 दिन',
    '86400_second' => '86400 सेकंड',
    '1_week' => '1 सप्ताह',
    '604800_second' => '604800 सेकंड',
    '1_month' => '1 महीना (30.44 दिन)',
    '2629743_second' => '2629743 सेकंड',
    '1_year' => '1 वर्ष (365.24 दिन)',
    '31556926_second' => '31556926 सेकंड',
    '2038' => '19 जनवरी 2038 को क्या होगा?',
    '2038_des_1' => '2038 की समस्या (जिसे Y2038, Epochalypse, Y2k38, या Unix Y2K भी कहा जाता है) का संबंध कई डिजिटल प्रणालियों में समय को सेकंड की संख्या के रूप में दर्शाने से है जो 00:00:00 UTC से 1 जनवरी 1970 से शुरू होती है
           और इसे साइन किए गए 32-बिट पूर्णांक के रूप में स्टोर किया जाता है। ऐसे कार्यान्वयन 19 जनवरी 2038 को 03:14:07 UTC के बाद का समय को एनकोड नहीं कर सकते। Y2K समस्या की तरह, 2038 की समस्या भी
           समय का प्रतिनिधित्व करने के लिए उपयोग किए गए अपर्याप्त क्षमता के कारण होती है।',
    '2038_des_2' => '1 जनवरी 1970 के बाद से सबसे देर तक समय जिसे साइन किए गए 32-बिट पूर्णांक का उपयोग करके स्टोर किया जा सकता है, वह 19 जनवरी 2038 को मंगलवार, 03:14:07 (231-1 = 2,147,483,647 सेकंड बाद 1 जनवरी 1970) है।
           प्रोग्राम जो इस तिथि के बाद समय बढ़ाने का प्रयास करेंगे, वह इसे आंतरिक रूप से नकारात्मक संख्या के रूप में स्टोर करेंगे, जिसे ये सिस्टम 13 दिसंबर 1901 को शुक्रवार, 20:45:52 (2,147,483,648 सेकंड पहले 1 जनवरी 1970)
           के रूप में व्याख्यायित करेंगे, बजाय 19 जनवरी 2038 के। यह पूर्णांक ओवरफ़्लो के कारण होता है, जिसमें काउंटर का उपयोग करने योग्य अंक समाप्त हो जाते हैं, और फिर साइन बिट को बदल दिया जाता है। इससे सबसे नकारात्मक संख्या की रिपोर्ट होती है,
           और फिर यह शून्य की ओर बढ़ता है, फिर सकारात्मक पूर्णांकों के माध्यम से फिर से बढ़ता है। ऐसी प्रणालियों पर गलत गणनाओं के परिणामस्वरूप उपयोगकर्ताओं और अन्य संबंधित पक्षों के लिए समस्याएं उत्पन्न हो सकती हैं।',
];
