<?php

return [
    'title' => 'ከ ታይምስታምፕ ወደ ቀን መቀየር - ዩኒክስ ታይምስታምፕ መቀየር',
    'h1' => 'ዩኒክስ ታይምስታምፕ ወደ ቀን መቀየር መሳሪያ',
    'meta_keywords' => 'ታይምስታምፕ ወደ ቀን መቀየር መሳሪያ',
    'meta_description' => 'ዩኒክስ ታይምስታምፕን ወደ ተነበበ ቀን በቀላሉ በነፃ እና ቀላል መሳሪያችን በመጠቀም ቀይር። ፈጣን፣ ትክክለኛ፣ እና ቀላል ለመጠቀም።',
    'meta_title' => 'ታይምስታምፕ ወደ ቀን መቀየር መሳሪያ - ወዲያውኑ ዩኒክስ ታይምስታምፕ መቀየር',
    'locale' => 'am-ET',
    'select_language' => 'ቋንቋ ይምረጡ',
    'summary' => 'ዩኒክስ ታይምስታምፕን በቀላሉ ይቀይሩ',
    'copy_time' => 'ቅዳ',
    'done_copy' => 'ተቀድ!',
    'begin_start' => 'ከ 1970 ጃንዩዌሪ 1 ጀምሮ ሰከንዶች። (UTC)',
    'enter_time' => 'ታይምስታምፕ ያስገቡ',
    'enter_date' => 'ቀን እና ሰዓት ያስገቡ',
    'year' => 'አመት',
    'month' => 'ወር',
    'day' => 'ቀን',
    'hour' => 'ሰዓት',
    'hour_24h' => 'ሰዓት (24h)',
    'minutes' => 'ደቂቃዎች',
    'seconds' => 'ሰከንዶች',
    'format' => 'ቅርጸት',
    'your_time_zone' => 'የእርስዎ ዘመን ክልል',
    'relative' => 'ተዛማጅ',
    'what_unix' => 'ዩኒክስ ታይምስታምፕ ምንድን ነው?',
    'unix_des' => 'ዩኒክስ ታይምስታምፕ ጊዜን በሚቆጣጠር ጠቅላላ ሰከንዶች እንደ መከታተል ዘዴ ነው።
           ነዚህ ቁጥሮች ከ ዩኒክስ ኤፖክ ጃንዩዌሪ 1፣ 1970 እንደሚጀምሩ ታይምስታምፕን ተዛማጅ ቀን እና ኤፖክ መካከል ሰከንዶች ብቻ ነው።
           ይህ ጊዜ በምንኛውም አካባቢ አለን ብለው ተመስሏል።
           ለኮምፒዩተር ስርዓቶች ቀናትን ማከታተል እና መስራት ላይ በጣም ጠቃሚ ነው።',
    'human_time' => 'በሰው የሚነበብ ጊዜ',
    '1_minute' => '1 ደቂቃ',
    '60_second' => '60 ሰከንድ',
    '1_hour' => '1 ሰዓት',
    '3600_second' => '3600 ሰከንድ',
    '1_day' => '1 ቀን',
    '86400_second' => '86400 ሰከንድ',
    '1_week' => '1 ሳምንት',
    '604800_second' => '604800 ሰከንድ',
    '1_month' => '1 ወር (30.44 ቀናት)',
    '2629743_second' => '2629743 ሰከንድ',
    '1_year' => '1 አመት (365.24 ቀናት)',
    '31556926_second' => '31556926 ሰከንድ',
    '2038' => 'በጃንዩዌሪ 19፣ 2038 ምን ይከሰታል?',
    '2038_des_1' => 'የ አመት 2038 ችግር (እንደ ዩ2038፣ ኤፖካሊፕስ፣ Y2k38 ወይም ዩኒክስ Y2K) ከ ዩኒክስ ታይምስታምፕ ማቅረብና ከ 00:00:00 UTC በ 1
           ጃንዩዌሪ 1970 ወደ ቁጥር መቆጣጠር ጋር ይጋርዳል።
           ትህትና አቀማመጥ ለ ታይምስታምፕ የተደረገበት የሰከንዶች አቅም ስለማልቀስ ችግር ይኖራል።',
    '2038_des_2' => 'በ 1 ጃንዩዌሪ 1970 ከሚታመን ያለ ቀን ነው፤ በ 2038 ምሽት 03:14:07 በክልል ነበር።
           ከእንዲህ በላይ በስርዓት ውስጥ ወደታንኳ ተመለሰ፤ እና በተላላፊ ተጨማሪ ችግር ተወስዷል።'
];
